#+TITLE: Pelle's GNU Emacs Config
#+AUTHOR: Pelle Schöld
#+DESCRIPTION: My Personal Emacs config
#+STARTUP: showeverything
#+OPTIONS: toc:2

** Org mode parentheses missmatch fix
#+begin_src emacs-lisp
  (defun org-syntax-table-modify ()
    "Modify `org-mode-syntax-table' for the current org buffer."
    (modify-syntax-entry ?< "." org-mode-syntax-table)
    (modify-syntax-entry ?> "." org-mode-syntax-table)
    (modify-syntax-entry ?/ "." org-mode-syntax-table))

  (add-hook 'org-mode-hook #'org-syntax-table-modify)
#+end_src

#+RESULTS:
| #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | #[nil ((org-bullets-mode 1)) (t)] | toc-org-enable | #[nil ((electric-indent-local-mode -1)) nil] | org-syntax-table-modify | org-tempo-setup | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |


